[Buff_test_ability_defense.A_Inactif_Buff H7BaseBuff]
mName="设置非活跃增益"
mTooltip=""

[haven_specialisation.A_Chaplain_dresseur H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="天国热忱"
mTooltip="该英雄使司铎和教士的生命值提高 %buff1.buff.stat1 %icon_health，并且这些生物总是进行最大射程攻击。"

[haven_specialisation.A_Chaplain_Dresseur_Buff H7BaseBuff]
mName="鼠型怪训练师"
mTooltip="%stat1 %icon_health 加成，并且此生物总是进行最大射程攻击。"

[haven_specialisation.A_SonOfThegriffin H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狮鹫之子"
mTooltip="英雄军队中所有生物使用 %spell1.name 后无惩罚。"

[haven_specialisation.A_wolf_Tamer_Ridonna_Buff H7BaseBuff]
mName="狼驯养师"
mTooltip=""

[heropedya.A_HeroBio_A_Azaghal H7HeroBioData]
mText="阿扎戈尔和布丽姬德的故事清楚地证明了真爱无障碍。在他心爱的妻子失踪后，深感悲伤的矮人组织了一支搜索队，并在其他所有人都失去希望时仍然相信奇迹。久别重逢后，这对幸福的夫妇经常在街上散步，不自觉地吸引路人的注意，但这丝毫没有困扰阿扎戈尔。无论布丽姬德变成什么样子，她将永远是他心中唯一的女人。"

[heropedya.A_HeroBio_Asdis H7HeroBioData]
mText=""

[heropedya.A_HeroBio_Bjormlir H7HeroBioData]
mText="比约尔米尔一生中获得过许多战利品，但他的收藏中有一个特殊的位置留给了他从不离身的熊皮斗篷。在与一只令该地区恐惧的强大野兽进行艰苦战斗后，这位矮人意识到狩猎是他的使命。在格里姆海姆，比约尔米尔更出名的是他作为熟练的驯兽师，即使是最凶猛的捕食者在遇到他后也会变得温顺听话。在石厅的动物园里，他挑选最好的熊，亲自教育和训练它们，以便将这些可怕的野兽加入矮人军队。"

[heropedya.A_HeroBio_Durin H7HeroBioData]
mText="年轻的指挥官和出色的战略家杜林尤其以她的口才闻名——无论她计划什么，她总能激励足够多的矮人男女。在大多数情况下，她更喜欢谈判而不是战斗。确实，她用犀利的舌头赢得的战斗比用锋利的斧头赢得的更多——尽管她也擅长使用斧头。除此之外，她喜欢有胡子的矮人、烈性的熊啤酒和修辞比赛。"

[heropedya.A_HeroBio_Gimmily H7HeroBioData]
mText=""

[heropedya.A_HeroBio_Hraunsmidur H7HeroBioData]
mText="赫朗斯米杜尔在锻造炉火中看到的格里姆海姆严峻未来的景象，促使他在法索尔特被推翻前不久离开了皇家铁匠的职位。仿佛是神圣意志的指引，他去了奥斯特格德，在那里他的才华得到了很好的发挥。前哨的防御者相信，得益于赫朗斯米杜尔注入其盔甲和武器中的阿尔卡斯的赐福，矮人护卫队几乎能够与霜巨人势均力敌地战斗，而无须惧怕严寒。"

[heropedya.A_HeroBio_Mashaka H7HeroBioData]
mText="即使是白发苍苍的战士也会重视这位曾组织奥斯特格德防御的盾女的意见。当阿尔卡斯的圣火熄灭、格里姆海姆的土地被冰雪覆盖的可怕消息传到前哨居民耳中时，正是玛莎卡找到了提振同胞斗志的恰当言辞。她坚强的意志多次受到命运的严峻考验，但无论是被奥斯特格德编年史记载为“芬布尔之冬”的长期暴风雪，还是随后好战的冰霜巨人部落的袭击，都未能动摇它。"

[heropedya.A_HeroBio_Thorgrim H7HeroBioData]
mText=""

[heropedya.A_HeroBio_trebor H7HeroBioData]
mText=""

[MagicSchool.A_affaiblissement_magique H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔力削弱"
mTooltip="敌方英雄每次对友方单位造成伤害时，其 %Icon_magic 魔力降低 %buff.buff.stat1。"

[MagicSchool.A_affaiblissement_magique_Buff H7BaseBuff]
mName="魔力削弱"
mTooltip="英雄每次对友方单位造成伤害时，其魔力降低 %stat1。"

[MagicSchool.A_brasier H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火盆"
mTooltip="该英雄在战斗开始时对所有敌人造成 %d 火焰伤害 %icon_fire。"

[MagicSchool.A_Defensur_des_flammes H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰防御者"
mTooltip="每当英雄对友方生物施放基于火焰的正面法术时，其魔力提高 %stat %stat.icon 魔力。"

[MagicSchool.A_FlameWielder H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰操纵者"
mTooltip="每当英雄施放基于火焰的进攻法术时，其魔力提高 %stat %stat.icon 魔力。"

[Mightshcool.A_BearTamer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="熊驯养师"
mTooltip="英雄军队中的熊和黑熊拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。"

[Mightshcool.A_BearTamer_Buff H7BaseBuff]
mName="熊驯养师"
mTooltip=""

[Mightshcool.A_Damager H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="进攻术"
mTooltip="该英雄使英雄军队中所有单位造成的伤害提高 %buff.buff.stat2 %buff.buff.stat2.icon。"

[Mightshcool.A_Damager_Buff H7BaseBuff]
mName="进攻术"
mTooltip="该生物的伤害提高 %stat1。"

[Mightshcool.A_Devoreur_ame H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="生存专家"
mTooltip="当一个友方生物堆栈被摧毁时，该英雄给予友方生物 %buff1.buff.buff1.buff.stat1 %icon_health 生命值，直到它们下一回合结束。"

[Mightshcool.A_devoreur_ame_Buff H7BaseBuff]
mName="灵魂吞噬者"
mTooltip="当一个友方生物堆栈死亡时，所有友军获得 %buff1.buff.stat1 最大生命值 %icon_health，直到它们下一回合结束。"

[Mightshcool.A_devoreur_ame_creature_Buff H7BaseBuff]
mName="生存"
mTooltip="生物的 %icon_health 生命值提高 %stat1，直到下一回合结束。"

[Mightshcool.A_DwarvenResistance H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="矮人抗性"
mTooltip="英雄军队中所有矮人、鼠型怪、熊和珊提瑞魔像获得 %spell1.name 技能。"

[Mightshcool.A_epuisement H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="衰竭"
mTooltip="该英雄在 %buff.buff.durini 回合内，使其攻击的生物的攻击降低 %buff.buff.stat2 %buff.buff.stat2.icon。该值根据英雄的 %icon_magic 等级变化。"

[Mightshcool.A_epuisement_Buff H7BaseBuff]
mName="衰竭"
mTooltip="该生物的攻击降低 %stat1.norm %icon_attack。"

[Mightshcool.A_Magog_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火焰战线"
mTooltip="“混沌之子”和“玛各”生物进行最大射程射击。"

[Mightshcool.A_magog_master_Buff H7BaseBuff]
mName=""
mTooltip=""

[Mightshcool.A_Mobilite_strategique H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="战略机动"
mTooltip="总督技能：该英雄为所有友方英雄提供 %buff1.buff.stat2 %icon_movement 最大移动力。如果该英雄拥有 %spell3.name 技能，则该值翻倍。\n（需要在学会该技能后重新任命英雄为总督一次）。"

[Mightshcool.A_Mobilite_strategique_Buff H7BaseBuff]
mName=""
mTooltip=""

[Mightshcool.A_moisson H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="灵魂收割"
mTooltip="战斗中摧毁的每个敌方生物堆栈为英雄提供 %buff.buff.special %icon_gold 黄金。"

[Mightshcool.A_moisson_creature_Buff H7BaseBuff]
mName="收割"
mTooltip=""

[Mightshcool.A_Recruiter_core_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="部落领袖"
mTooltip="总督技能：在该城镇招募生物花费减少 %special1% %icon_gold 黄金。"

[Mightshcool.A_Recruiter_core_TownBuff H7BaseBuff]
mName="招募官（城镇增益）"
mTooltip=""

[Mightshcool.A_Tresorier H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="司库"
mTooltip="总督技能：该英雄每天提供 %buff1.buff.stat2 %icon_gold 黄金。如果该英雄拥有技能：%spell3.name，则该值翻倍（需要在学会该技能后重新任命英雄为总督一次）。"

[Mightshcool.A_Tresorier_Buff H7BaseBuff]
mName=""
mTooltip=""

[New_hero.A_Asdis H7EditorHero]
mName=""
mLore=""

[New_hero.A_Asdis_Name H7GlobalName]
mName="阿斯迪斯"

[New_hero.A_Azaghal H7EditorHero]
mName=""
mLore=""

[New_hero.A_Azaghal_Name H7GlobalName]
mName="阿扎戈尔"

[New_hero.A_Bjormlir H7EditorHero]
mName=""
mLore=""

[New_hero.A_Bjormlir_Name H7GlobalName]
mName="比约尔米尔"

[New_hero.A_Durin H7EditorHero]
mName=""
mLore=""

[New_hero.A_Durin_Name H7GlobalName]
mName="杜林"

[New_hero.A_Fasolt H7EditorHero]
mName=""
mLore=""

[New_hero.A_Guimmily_Name H7GlobalName]
mName="吉米利"

[New_hero.A_Hraunsmidur H7EditorHero]
mName=""
mLore=""

[New_hero.A_Hraunsmidur_Name H7GlobalName]
mName="赫朗斯米杜尔"

[New_hero.A_Mashaka H7EditorHero]
mName=""
mLore=""

[New_hero.A_Mashaka_Name H7GlobalName]
mName="玛莎卡"

[New_hero.A_Thorgrim H7EditorHero]
mName=""
mLore=""

[New_hero.A_Thorgrim_Name H7GlobalName]
mName="索尔格林"

[New_hero.A_Trebor_Name H7GlobalName]
mName="特雷伯"

[New_hero.Trebor H7EditorHero]
mName="布鲁克"
mLore=""

[Specialisation_Academie.A_Gargoils_Builder H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="石像鬼建造师"
mTooltip="总督技能：增加该城控制区域内石像鬼和黑曜石石像鬼的 %buff1.buff.stat 周产量。"

[Specialisation_Academie.A_Gargoils_Builder_Buff H7BaseBuff]
mName="魔像建造师"
mTooltip=""

[Specialisation_Academie.A_Mage_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="法师长"
mTooltip="该英雄使其军队中法师学徒和法师门徒的生命值提高 %buff1.buff.stat1 %icon_health，并且这些生物总是进行最大射程攻击。"

[Specialisation_Academie.A_Mage_master_Buff H7BaseBuff]
mName="法师长"
mTooltip="%stat1 %icon_health 加成。\n此生物总是进行最大射程攻击。"

[Specialisation_Academie.A_Windspeaker H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="风语"
mTooltip="英雄军队中所有单位获得 %buff.buff.stat1 %buff.buff.stat1.icon 主动性。"

[Specialisation_Academie.A_Windspeaker_Buff H7BaseBuff]
mName="风语者"
mTooltip=""

[Specialisation_Dungeon.A_Chtonian_trainer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="血腥利刃"
mTooltip="英雄军队中的刺客和幽影拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。"

[Specialisation_Dungeon.A_Chtonien_trainer_Buff H7BaseBuff]
mName="熊驯养师"
mTooltip=""

[Specialisation_Dungeon.A_Fortune_Mastero_Buff H7BaseBuff]
mName="幸运"
mTooltip="%stat %stat.icon 幸运\n持续 %durnow 回合。"

[Specialisation_Dungeon.A_Hydra_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="九头蛇之母"
mTooltip="该英雄使其军队中洞穴九头蛇和黑暗九头蛇的生命值 %icon_health 提高 %buff1.buff.stat1。"

[Specialisation_Dungeon.A_Hydra_master_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_Dungeon.A_Marionettiste_trainer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="傀儡师"
mTooltip="英雄军队中的潜行者和无魂者拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。"

[Specialisation_Dungeon.A_Marionettiste_trainer_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_Dungeon.A_master_of_destiny H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="命运主宰"
mTooltip=" 每场战斗开始时，所有友方远程生物获得 %spell.name。此法术以专家等级施放。"

[Specialisation_Dungeon.A_stalker_trainer H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影训练师"
mTooltip="该英雄使其军队中追猎者和追猎者的生命值提高 %buff1.buff.stat1 %icon_health，并且这些生物总是进行最大射程攻击。"

[Specialisation_Dungeon.A_stalker_trainer_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_fortress.A_DaughterOfArkath H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="阿尔卡斯之女"
mTooltip="英雄军队中的女圣灵和女武神拥有 %buff.buff.stat1 %buff.buff.stat1.icon 幸运、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。"

[Specialisation_fortress.A_DaughterOfArkath_Buff H7BaseBuff]
mName="阿尔卡斯之女"
mTooltip=""

[Specialisation_fortress.A_giant_fire_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="神圣战锤"
mTooltip="英雄军队中的英灵战士可以无限制地使用技能：战锤投掷。"

[Specialisation_fortress.A_Kobolt_dresseur H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="鼠型怪训练师"
mTooltip="该英雄使鼠型怪探路者和鼠型怪侦察兵的生命值提高 %buff1.buff.stat1 %icon_health，并且这些生物总是进行最大射程攻击。"

[Specialisation_fortress.A_Kobolt_Dresseur_Buff H7BaseBuff]
mName="鼠型怪训练师"
mTooltip="%stat1 %icon_health 加成。\n此生物总是进行最大射程攻击。"

[Specialisation_fortress.A_Resistance_naine H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="矮人抗性"
mTooltip="来自敌方攻击的所有伤害减少15%。"

[Specialisation_fortress.A_SacredHammer_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="神圣战锤"
mTooltip="每次施放光明法术时，获得 %buff.buff.buff.buff.stat %buff.buff.buff.buff.stat.icon 力量。持续到战斗结束。"

[Specialisation_fortress.A_SacredHammer_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_fortress.A_SacredHammer_Buff_Might H7BaseBuff]
mName="神圣战锤"
mTooltip=""

[Specialisation_fortress.A_ThrowingHammer H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="强化投锤"
mTooltip="该生物进行最大射程的远程攻击，并获得 %buff1.buff.stat1 %icon_attack 攻击。每场战斗只能使用一次。每当该堆栈的一个生物被杀死时 recharge。"

[Specialisation_fortress.A_Vitalite_naine_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_fortress.A_Vitalite_naine_hero_Buff H7BaseBuff]
mName="招募官（城镇增益）"
mTooltip=""

[Specialisation_necropolis.A_Inlassable H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地产出"
mTooltip="该英雄控制下的骷髅和骷髅重步兵获得 %spell1.name（死亡后复活30%的堆栈）。"

[Specialisation_necropolis.A_RangedAttack_Dark_Bullet H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗影布"
mTooltip="造成 %d 暗影伤害 %icon_dark。"

[Specialisation_necropolis.A_Rebirth_Squeletton H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="大地产出"
mTooltip="每场战斗一次，如果该生物被完全杀死，它会以原始数量的 %buff.buff.special 复活，并移除所有效果。"

[Specialisation_necropolis.A_Rebirth_Squelleton_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_necropolis.A_spider_boost H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="虚空编织者"
mTooltip="英雄军队中的织死蜘蛛和黑檀蜘蛛获得 %spell1.name 技能，并可以进行远程攻击。"

[Specialisation_necropolis.A_Walking_dead_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_necropolis.A_Walking_dead_hero_Buff H7BaseBuff]
mName="招募官（城镇增益）"
mTooltip=""

[Specialisation_sylvan.A_amis_de_la_nature_specialisation H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="自然之友"
mTooltip="每场战斗开始时，所有友方近战生物获得 %spell.name。此法术以专家等级施放。"

[Specialisation_sylvan.A_Archer_lumineux_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_sylvan.A_Archer_lumineux_hero_Buff H7BaseBuff]
mName="招募官（城镇增益）"
mTooltip=""

[Specialisation_sylvan.A_Burning_allied_Buff H7BaseBuff]
mName="火焰光环"
mTooltip="该生物在暴击时点燃其目标，并造成 %icon_fire 伤害，持续 %buff1.buff.durini 回合。"

[Specialisation_sylvan.A_Burning_Buff H7BaseBuff]
mName="燃烧"
mTooltip="生物受到 %d 火焰伤害 %icon_fire。持续 %durnow 回合。"

[Specialisation_sylvan.A_Dragon_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="龙母"
mTooltip="该英雄使其军队中绿龙和翡翠龙的生命值 %icon_health 提高 %buff1.buff.stat1。"

[Specialisation_sylvan.A_Dragon_master_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_sylvan.A_elemntal_terrer_Buff H7BaseBuff]
mName=""
mTooltip=""

[Specialisation_sylvan.A_elemntaliste_terre_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="土元素师"
mTooltip="英雄在战斗中施放保护性或强化性 %icon_earth 土系法术后，他在该战斗轮中获得第二个回合。在第二个回合中施放的法术将获得 %buff1.buff.stat2 %ICON_MAGIC 魔力的效果。"


[Specialisation_sylvan.A_fire_rangered H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="逆反自然"
mTooltip="该英雄控制下的远程单位如果造成暴击，则会点燃目标。燃烧的生物根据英雄等级持续3回合受到伤害。"

[Specialisation_sylvan.A_Maitre_lame H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="利刃大师"
mTooltip="英雄军队中的刃舞者和刃舞大师获得 %spell1.name 和 %spell2.name 技能。"

[Specialisation_sylvan.A_Regeneration_trebor_Buff H7BaseBuff]
mName="活力再生"
mTooltip="该生物在其回合开始时恢复 %d.min 生命值。\n持续 %durnow 回合。"

[Specialisation_sylvan.A_Treant_master H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="森林之魂"
mTooltip="英雄军队中的树精和远古树精进行最大射程射击。"

[Specialisation_sylvan.A_Treant_master_Buff H7BaseBuff]
mName=""
mTooltip=""

[Strongoldh_specialisation.A_BloodDrinker H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="饮血者"
mTooltip="英雄在杀死一个生物堆栈后获得 %buff1.buff.stat.norm %buff1.buff.stat.icon 力量。"

[Strongoldh_specialisation.A_BloodDrinker_Buff H7BaseBuff]
mName="饮血者"
mTooltip=""


[Strongoldh_specialisation.A_FlightChampion H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="飞行冠军"
mTooltip="英雄军队中的鹰身女妖和鹰身怒妖获得 %buff.buff.stat1 %buff.buff.stat1.icon 主动性和 %buff.buff.stat2 %buff.buff.stat2.icon 移动力。"

[Strongoldh_specialisation.A_FlightChampion_Buff H7BaseBuff]
mName="飞行冠军"
mTooltip=""

[Strongoldh_specialisation.A_PirateOfTheSavageSea H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="蛮荒海盗"
mTooltip="英雄军队中所有暴徒、巨蜥骑手、独眼巨人及其各自的升级形态获得 %spell1.name 技能。"

[Strongoldh_specialisation.A_Tormentor H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="折磨者"
mTooltip="英雄军队中的暴徒和碎击兵获得 %buff.buff.stat1 %buff.buff.stat1.icon 防御和 %buff.buff.stat2 %buff.buff.stat2.icon 生命值。"

[Strongoldh_specialisation.A_Tormentor_Buff H7BaseBuff]
mName="折磨者"
mTooltip=""

v1.35

[Buff_test_ability_defense.A_Inactif_creature_Buff H7BaseBuff]
mName="非活跃"
mTooltip="该生物本回合未造成伤害且未移动，因此获得 %stat1 %stat1.icon、%stat2 伤害，持续 %durnow 回合（此效果最多可叠加3次），伤害减免在该生物首次造成伤害前有效。"

[haven_specialisation.A_wolfTamer_ridonna H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狼驯养师"
mTooltip="英雄军队中的恐狼和银背狼拥有 %buff.buff.stat1 %buff.buff.stat1.icon 防御、%buff.buff.stat2 %buff.buff.stat2.icon 生命值，并获得 %spell3.name 技能。（该生物免疫所有类型的移动力减少）。"

[Strongoldh_specialisation.A_CyclopsRevenge H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="独眼复仇"
mTooltip="英雄军队中的独眼巨人和怒眼巨人获得 %spell1.name 技能。攻击该生物的敌方生物成为该生物愤怒的目标。拥有此技能的生物对所有被标记的生物的攻击将在3回合内必定暴击。"

[Specialisation_sylvan.A_Archer_lumineux_ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="光明箭术"
mTooltip="总督技能：只要该英雄是总督，所有友方英雄的远程生物获得技能：%Spell4.name（英雄军队中所有生物的远程攻击移除目标的一个随机正面效果）。"

[Specialisation_Academie.A_CabirLord H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="火精怪勋爵"
mTooltip="英雄军队中的火精怪和炎精怪获得 %spell1.name（激活后，该生物对3x3区域造成伤害，每场战斗1次）和 %spell2.name 技能。（被该生物远程攻击命中的大型生物将被点燃）"

[Specialisation_necropolis.A_Walking_dead_ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="行尸"
mTooltip="总督技能：只要该英雄是城市总督并且 %spell3.name 法术在他的法术书中已解锁，所有友方英雄在每场战斗开始时获得 %buff1.buff.buff.buff.stat %icon_Magic 魔力。"

[Specialisation_fortress.A_LavaSmith H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="熔岩之魂"
mTooltip="英雄军队中的熔岩元素和岩浆元素获得 %spell1.name（该生物攻击目标单位不受其移动范围限制且不遭受反击，并获得攻击加成和防御惩罚）和 %spell2.name 技能。（近战攻击或反击该生物的敌方生物承受所造成伤害作为火焰伤害）。"

[Specialisation_fortress.A_Vitalite_naine_ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="矮人活力"
mTooltip="总督技能：只要该英雄是总督，所有友方英雄的核心生物获得 %buff1.buff.buff.buff.stat %icon_health 生命值。"